НВ_Доработки/Catalogs/Контрагенты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>Контрагенты</Name>
			<Hierarchical>true</Hierarchical>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Дополнительно</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НВД_qrcld</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НВД_СтрокаQRМетки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НВД_imageParams_content</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НВД_ОрганизацияСБП</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НВД_СчетСБП</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>УДАЛИТЬ_Опт</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПотолкиОнлайн_Пароль</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДокументУдостоверяющийЛичность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДокументыУдостоверяющиеЛичность</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВидКонтрагента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидКонтрагента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОтправлятьСМС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>УДАЛИТЬ_Розница</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ГруппаДоступа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыДоступаККонтрагентам</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Категория</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КатегорииКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НаименованиеПолное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>УДАЛИТЬ_ФактическийАдрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>УДАЛИТЬ_ЮридическийАдрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ИдентификационныйНомерПлательщикаЕвропейскогоНДС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>УДАЛИТЬ_ОсновнойEMail</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>УДАЛИТЬ_ОсновнойТелефон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаРождения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПоказыватьДопИнформацию</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Пол</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПолФизическогоЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОсновнойБанковскийСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВариантОтправкиЭлектронногоЧека</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыОтправкиЭлектронногоЧекаПокупателю</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ИНН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>16</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>КПП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОГРН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОсновнойДоговор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Менеджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>КонтактноеЛицоПодписант</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КонтактныеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ИдентификаторБ24</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПотолкиОнлайн_Актуализирован</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НеОтправлятьСМС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НВД_ИспользоватьСБП</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СтатьяРасходов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДоходовИРасходов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Приоритет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПриоритетыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Метка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МеткиКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>КредитныйЛимит</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СпособДоставкиТовара</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СпособыДоставкиТовара</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СтавкаНДС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>УДАЛИТЬ_АдресаДоставки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Основной</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Адрес</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

НВ_Доработки/Catalogs/Контрагенты/Forms/ФормаВыбораДублей/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Контакты = Новый Массив;
	
	Параметры.Свойство("ИНН", ИНН);
	Параметры.Свойство("КПП", КПП);
	Параметры.Свойство("Наименование", Наименование);
	Параметры.Свойство("НаименованиеПолное", НаименованиеПолное);
	Параметры.Свойство("ИсключаяКонтакты", Контакты);
	Параметры.Свойство("ТипКИ", ТипКИ);
	Параметры.Свойство("СсылкаНаРедактируемыйОбъект", СсылкаНаРедактируемыйОбъект);
	Параметры.Свойство("ПредставлениеКИ", ПредставлениеКИ);
	
	Если Параметры.Свойство("ЭтоЮрЛицо") Тогда
		ЭтоЮрЛицо = Параметры.ЭтоЮрЛицо;
	КонецЕсли;
	
	Для Каждого Контакт Из Контакты Цикл
		НовыйКонтакт = ИсключаяКонтакты.Добавить();
		НовыйКонтакт.Контакт = Контакт;
	КонецЦикла;
	
	ОбновитьТаблицуДублей();
	УправлениеФормой();

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ПроизведенаЗаменаСсылок" Тогда
		ОбновитьТаблицуДублей();
	КонецЕсли;
	
	Если ИмяСобытия = "Запись_Контрагент" Тогда
		ОбновитьТаблицуДублей();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ТаблицаДублейВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если Элементы.ТаблицаДублей.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыПередачи = Новый Структура("Ключ", Элементы.ТаблицаДублей.ТекущиеДанные.Ссылка);
	ПараметрыПередачи.Вставить("ЗакрыватьПриЗакрытииВладельца", Истина);
	
	ОткрытьФорму(ИмяФормыПоТипуСсылки(Элементы.ТаблицаДублей.ТекущиеДанные.Тип),
		ПараметрыПередачи, 
		Элемент);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОбновитьТаблицуДублей()
	
	//Если ЗначениеЗаполнено(ИНН) Тогда
	//	ОбновитьСписокДублейПоИНН();
	//	Возврат;
	//КонецЕсли;
	
	Если ЗначениеЗаполнено(Наименование) Тогда
		ОбновитьСписокДублейПоНаименованию();
		Возврат;
	КонецЕсли;
	
	//Если ЗначениеЗаполнено(НаименованиеПолное) Тогда
	//	ОбновитьСписокДублейПоПолномуНаименованию();
	//	Возврат;
	//КонецЕсли;
	//
	//Если ЗначениеЗаполнено(ТипКИ) Тогда
	//	ОбновитьСписокДублейПоКИ();
	//	Возврат;
	//КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ОбновитьСписокДублейПоНаименованию()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 20
	|	Контрагенты.Ссылка КАК Ссылка,
	|	Контрагенты.Код КАК Код,
	|	Контрагенты.Наименование КАК Наименование,
	|	""Контрагент"" КАК Тип,
	|	1 КАК РеквизитДопУпорядочивания,
	|	ВЫБОР
	|		КОГДА Контрагенты.ПометкаУдаления
	|			ТОГДА 4
	|		ИНАЧЕ 3
	|	КОНЕЦ КАК СостояниеЭлементов,
	|	"""" КАК ОтветственныйНаименование,
	|	КИ.НомерТелефона КАК Телефон
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			КонтрагентыКонтактнаяИнформация.НомерТелефона КАК НомерТелефона,
	|			КонтрагентыКонтактнаяИнформация.Ссылка КАК Ссылка
	|		ИЗ
	|			Справочник.Контрагенты.КонтактнаяИнформация КАК КонтрагентыКонтактнаяИнформация
	|		ГДЕ
	|			КонтрагентыКонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон)
	|			И КонтрагентыКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ТелефонКонтрагента)) КАК КИ
	|		ПО Контрагенты.Ссылка = КИ.Ссылка
	|ГДЕ
	|	(Контрагенты.НаименованиеПолное ПОДОБНО &Наименование
	|			ИЛИ Контрагенты.Наименование ПОДОБНО &Наименование)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ ПЕРВЫЕ 20
	|	Контакты.Ссылка,
	|	Контакты.Код,
	|	Контакты.Наименование,
	|	""Контакт"",
	|	2,
	|	ВЫБОР
	|		КОГДА Контакты.ПометкаУдаления
	|			ТОГДА 4
	|		ИНАЧЕ 3
	|	КОНЕЦ,
	|	"""",
	|	КИ.НомерТелефона
	|ИЗ
	|	Справочник.КонтактныеЛица КАК Контакты
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			КонтрагентыКонтактнаяИнформация.НомерТелефона КАК НомерТелефона,
	|			КонтрагентыКонтактнаяИнформация.Ссылка КАК Ссылка
	|		ИЗ
	|			Справочник.Контрагенты.КонтактнаяИнформация КАК КонтрагентыКонтактнаяИнформация
	|		ГДЕ
	|			КонтрагентыКонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон)
	|			И КонтрагентыКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ТелефонКонтактногоЛица)) КАК КИ
	|		ПО Контакты.Ссылка = КИ.Ссылка
	|ГДЕ
	|	НЕ Контакты.Ссылка В (&Контакты)
	|	И Контакты.Наименование ПОДОБНО &Наименование
	|
	|УПОРЯДОЧИТЬ ПО
	|	РеквизитДопУпорядочивания,
	|	Наименование";
	
	Запрос.УстановитьПараметр("Наименование", Наименование);
	Контакты = ДанныеФормыВЗначение(ИсключаяКонтакты, Тип("ТаблицаЗначений")).ВыгрузитьКолонку("Контакт");
	Запрос.УстановитьПараметр("Контакты", Контакты);
	
	УстановитьПривилегированныйРежим(Истина);
	ТаблицаДублей.Загрузить(Запрос.Выполнить().Выгрузить());
	УстановитьПривилегированныйРежим(Ложь);

КонецПроцедуры

&НаКлиенте
Процедура Изменить(Команда)
	
	Если Элементы.ТаблицаДублей.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыПередачи = Новый Структура("Ключ", Элементы.ТаблицаДублей.ТекущиеДанные.Ссылка);
	ПараметрыПередачи.Вставить("ЗакрыватьПриЗакрытииВладельца", Истина);
	
	ОткрытьФорму(ИмяФормыПоТипуСсылки(Элементы.ТаблицаДублей.ТекущиеДанные.Тип),
		ПараметрыПередачи,
		Элементы.ТаблицаДублей);

КонецПроцедуры

&НаСервере
Процедура УправлениеФормой()
	
	Элементы.ТаблицаДублейИНН.Видимость = ЗначениеЗаполнено(ИНН);	
	Элементы.ТаблицаДублейКПП.Видимость = ЗначениеЗаполнено(ИНН) И ЭтоЮрЛицо;
	Элементы.ТаблицаДублейНаименованиеПолное.Видимость = ЗначениеЗаполнено(НаименованиеПолное);
	Элементы.ТаблицаДублейПредставлениеКИ.Видимость    = ЗначениеЗаполнено(ТипКИ);
	Элементы.ТаблицаДублейПредставлениеКИ.Заголовок = 
		?(ТипКИ = Перечисления.ТипыКонтактнойИнформации.Телефон, НСтр("ru = 'телефон'"), НСтр("ru = 'e-mail'"));
	
	Заголовок = ЗаголовокФормы();

	Контрагенты = ТаблицаДублей.НайтиСтроки(Новый Структура("Тип", "Контрагент"));
	Контакты    = ТаблицаДублей.НайтиСтроки(Новый Структура("Тип", "Контакт"));
	Лиды        = ТаблицаДублей.НайтиСтроки(Новый Структура("Тип", "Лид"));
			
КонецПроцедуры

&НаСервере
Функция ЗаголовокФормы()
	
	Заголовок = НСтр("ru = 'Список дублей по '");
	
	Если ЗначениеЗаполнено(ПредставлениеКИ) Тогда
		КИ = ?(ТипКИ = Перечисления.ТипыКонтактнойИнформации.Телефон, НСтр("ru='номеру телефона'"), НСтр("ru='e-mail'"));
		Возврат Заголовок + КИ;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(НаименованиеПолное) Тогда
		Заголовок = Заголовок + НСтр("ru='юр.названию'");
		Возврат Заголовок;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Наименование) Тогда
		Заголовок = Заголовок + НСтр("ru='представлению'");
		Возврат Заголовок;
	КонецЕсли;
	
	Возврат ?(ЗначениеЗаполнено(КПП),
					Заголовок + НСтр("ru = 'ИНН и КПП'"),
					Заголовок + НСтр("ru = 'ИНН'"));
	
КонецФункции

&НаКлиенте
Процедура ПерейтиККонтрагенту(Команда)
	
	ТекущийКонтрагент    = Элементы.ТаблицаДублей.ТекущиеДанные.Ссылка;
	//ЕстьПравоПоРЛС = ЕстьПравоПоРЛС(ТекущийКонтрагент);

	Если ЗначениеЗаполнено(СсылкаНаРедактируемыйОбъект) Тогда
		ПараметрыКонтрагента = Новый Структура("Ключ", ТекущийКонтрагент);
		ОткрытьФорму("Справочник.Контрагенты.Форма.ФормаЭлемента", ПараметрыКонтрагента);
		Возврат;
	КонецЕсли;
	
	//Если НЕ ЕстьПравоПоРЛС Тогда
	//	ТекстПредупреждения = НСтр("ru = 'Нет прав на чтение объекта'");
	//	ПоказатьПредупреждение(,ТекстПредупреждения);
	//	Возврат;
	//КонецЕсли;
	
	Оповещение = Новый ОписаниеОповещения("ОбработатьВопросПерейтиКОбъекту",ЭтотОбъект);
	ТекстВопроса = НСтр("ru = 'Продолжить работу с выбранным контрагентом без сохранения текущего?'");
	ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ОКОтмена);

КонецПроцедуры

//&НаСервере
//Функция ЕстьПравоПоРЛС(Ссылка)
//	Возврат УправлениеДоступом.ЧтениеРазрешено(Ссылка);
//КонецФункции

&НаКлиенте
Процедура ОбработатьВопросПерейтиКОбъекту(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Отмена Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыЗакрытия = Новый Структура;
	ПараметрыЗакрытия.Вставить("ВыбранДубльКонтрагента", Истина);
	ПараметрыЗакрытия.Вставить("ВыбранныйКонтрагент",     Элементы.ТаблицаДублей.ТекущиеДанные.Ссылка);
	
	Закрыть(ПараметрыЗакрытия);
	
КонецПроцедуры 

&НаКлиенте
Функция ИмяФормыПоТипуСсылки(Тип)
	
	Если Тип = "Контрагент" Тогда
		Возврат "Справочник.Контрагенты.ФормаОбъекта";
	КонецЕсли;
	
	Если Тип = "Контакт" Тогда
		Возврат "Справочник.КонтактныеЛица.ФормаОбъекта";
	КонецЕсли;
		
КонецФункции

#КонецОбласти
